In [75]:
import pandas as pd

# Create sample DataFrames
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3], 'value3': [44, 54, 66]})
df2 = pd.DataFrame({'key': ['A', 'B', 'D'], 'value2': [4, 5, 6], 'value3': [46, 56, 66]})

In [77]:
# Merge 
pd.merge(df1, df2)

Empty DataFrame
Columns: [key, value1, value3, value2]
Index: []

In [79]:
# Merge on 'key' column
pd.merge(df1, df2, on='key')

  key  value1  value3_x  value2  value3_y
0   A       1        44       4        46
1   B       2        54       5        56

In [85]:
# adding suffixes
pd.merge(df1, df2, on='key', suffixes = ('_3V','_3y'))

  key  value1  value3_3V  value2  value3_3y
0   A       1         44       4         46
1   B       2         54       5         56

In [97]:
df3 = pd.DataFrame({'keyw': ['A', 'B', 'C'], 'value1': [1, 2, 3], 'value3w': [46, 54, 64]})
df4 = pd.DataFrame({'key': ['A', 'B', 'D'], 'value2': [4, 5, 6], 'value3': [46, 56, 66]})
pd.merge(df3, df4, left_on=('keyw','value3w'), right_on=('key','value3'))

  keyw  value1  value3w key  value2  value3
0    A       1       46   A       4      46

In [99]:
pd.merge(df3, df4, left_on='keyw', right_on='key')

  keyw  value1  value3w key  value2  value3
0    A       1       46   A       4      46
1    B       2       54   B       5      56

In [115]:
#for outer join using indicator
result = pd.merge(df1, df2, on='key', how='outer', indicator=True)
result

  key  value1  value3_x  value2  value3_y      _merge
0   A     1.0      44.0     4.0      46.0        both
1   B     2.0      54.0     5.0      56.0        both
2   C     3.0      66.0     NaN       NaN   left_only
3   D     NaN       NaN     6.0      66.0  right_only

In [117]:
#get value count 
result['_merge'].value_counts

<bound method IndexOpsMixin.value_counts of 0          both
1          both
2     left_only
3    right_only
Name: _merge, dtype: category
Categories (3, object): ['left_only', 'right_only', 'both']>

In [127]:
# merge based on index
pd.merge(df3, df4, left_index = True, right_index=True)

  keyw  value1  value3w key  value2  value3
0    A       1       46   A       4      46
1    B       2       54   B       5      56
2    C       3       64   D       6      66